// src/utils/cardData.ts

export const professions = [
  "Врач", "Повар", "Механик", "Программист", "Солдат", "Учитель", "Фермер", "Пилот", "Химик", "Биолог",
  "Художник", "Музыкант", "Пожарный", "Полицейский", "Архитектор", "Инженер", "Юрист", "Журналист", "Психолог", "Физик",
  "Актёр", "Таксист", "Сантехник", "Электрик", "Ветеринар", "Тренер", "Спасатель", "Дизайнер", "Бариста", "Строитель",
  "Фотограф", "Переводчик", "Агроном", "Писатель", "Сварщик", "Бухгалтер", "Официант", "Геолог", "Маркетолог", "Экономист",
  "Бортпроводник", "Плотник", "Лесник", "Разработчик ИИ", "Массажист", "Космонавт", "Механик танков", "Киберспортсмен", "Ювелир", "Парикмахер",
  "Видеомонтажёр", "Охотник", "Географ", "Метеоролог", "Моряк", "Навигатор", "Шахтёр", "Инспектор", "Кузнец", "Кассир",
  "Блогер", "Флорист", "Кондитер", "Дипломат", "Разведчик", "Инкассатор", "Садовник", "Модельер", "Лаборант", "Философ",
  "Зоолог", "Палеонтолог", "Дрессировщик", "Вожатый", "Диджей", "Видеоблогер", "Секретарь", "Диспетчер", "Почтальон", "Криминалист",
  "Юрисконсульт", "Историк", "Эколог", "Продавец", "Менеджер", "Грумер", "Охранник", "Логист", "Картограф", "Татуировщик",
  "Психиатр", "Тренер по выживанию", "Океанограф", "Радиотехник", "Актуарий", "Курьер", "Писарь", "Рекрутер", "Интерн", "Хореограф"
];

export const ages = Array.from({ length: 100 }, (_, i) => (16 + i).toString());

export const health = [
  "Здоров", "Астма", "Диабет", "Слепота", "Глухота", "Протез руки", "Протез ноги", "Хрупкие кости", "Ожирение", "Гемофилия",
  "Аллергия на пыль", "Шизофрения", "Панические атаки", "Сколиоз", "Хроническая усталость", "Иммунодефицит", "Туберкулёз", "Рак 1 стадии", "ВИЧ+", "Близорукость",
  "Плоскостопие", "Наркомания (в ремиссии)", "Алкоголизм (в ремиссии)", "Ожог лица", "Инвалидность 2 группы", "Тремор", "Тики", "Эпилепсия", "Гастрит", "Целлюлит",
  "Простуда", "Корь", "Псориаз", "Глухонемота", "Сахарный диабет 2 типа", "Аритмия", "Инсомния", "ЗПР", "Аутизм", "Нарушение памяти",
  "Тахикардия", "Гипотония", "Гипертония", "Мигрень", "Грыжа", "Нарушение слуха", "Астигматизм", "Нервный тик", "Утрата конечности", "ДЦП",
  "Деменция", "Гастроэнтерит", "Нефрит", "Холецистит", "Простатит", "Панкреатит", "Катаракта", "Глаукома", "ЗППП", "Синдром хронической боли",
  "Аутоиммунное заболевание", "Анорексия", "Булемия", "Фобии", "Панические атаки", "Психоз", "Токсикомания", "Шизоаффективное расстройство", "Нарциссизм", "Биполярное расстройство",
  "Туберкулёз костей", "Гепатит", "Невралгия", "Цирроз", "Пневмония", "Миопия", "Астигматизм", "Ушиб позвоночника", "Сотрясение мозга", "Невроз",
  "Психопатия", "Паранойя", "Остеопороз", "Миастения", "Кариес", "Туберкулёз лёгких", "Сердечная недостаточность", "Ожог руки", "Порок сердца", "Инфекция крови",
  "Синдром раздражённого кишечника", "Холера", "Дизентерия", "Амнезия", "Химическое отравление", "Лучевая болезнь", "Импотенция", "Бесплодие", "Аутизм", "ОКР"
];

export const phobias = [
  "Нет", "Темнота", "Замкнутое пространство", "Кровь", "Высота", "Глубина", "Огонь", "Вода", "Толпа", "Одиночество",
  "Пауки", "Змеи", "Насекомые", "Собаки", "Кошки", "Молния", "Шум", "Скорость", "Грязь", "Гололёд",
  "Мосты", "Эскалаторы", "Самолёты", "Маски", "Иглы", "Больницы", "Старики", "Дети", "Куклы", "Клоуны",
  "Отражения", "Зеркала", "Ночь", "Пустота", "Высокие здания", "Низкие потолки", "Смех", "Плач", "Массовка", "Кровати",
  "Шорох", "Стекло", "Глаз", "Тени", "Тишина", "Громкие звуки", "Мех", "Волосы", "Яйца", "Молочные продукты",
  "Шприцы", "Медицинские приборы", "Вирусы", "Заражение", "Старение", "Смерть", "Воскрешение", "Инопланетяне", "Роботы", "ИИ",
  "Интернет", "Телефоны", "Фотографии", "Записи", "Почерк", "Зубы", "Голоса", "Окна", "Двери", "Картон",
  "Песок", "Шелест", "Камни", "Пыль", "Плесень", "Капли", "Грибок", "Масла", "Слизь", "Мед",
  "Сухость", "Жара", "Холод", "Боль", "Скука", "Рвота", "Раны", "Скелеты", "Трупы", "Открытые пространства",
  "Лестницы", "Пол", "Потолок", "Голоса в голове", "Сон", "Бессонница", "Остановка сердца", "Удушье", "Гроза", "Ржавчина"
];

export const skills = [
  "Медицина", "Стрельба", "Охота", "Рыбалка", "Сбор грибов", "Фильтрация воды", "Ремонт техники", "Полевое строительство", "Взлом", "Маскировка",
  "Навигация", "Допрос", "Связь по радио", "Картография", "Перевязка ран", "Выращивание еды", "Вождение", "Механика", "Копка", "Чтение схем",
  "Психология", "Переговоры", "Изготовление инструментов", "Противодействие панике", "Кулинария", "Вязание узлов", "Программирование", "Разминирование", "Тихое передвижение", "Подъём по стенам",
  "Сбор медикаментов", "Анализ состояния", "Медитация", "Слежка", "Укрытие в природе", "Жесты", "Обход ловушек", "Работа с металлом", "Паять провода", "Микросхемы",
  "Лечение травами", "Создание лекарств", "Химический анализ", "Биология", "Поддержание гигиены", "Разведение огня", "Изоляция помещений", "Оценка угроз", "Тренировка", "Самооборона",
  "Оказание первой помощи", "Инстинкт выживания", "Планирование", "Командование", "Прикладная физика", "Уход за животными", "Полевые расчёты", "Оценка рисков", "Физподготовка", "Обезвреживание людей",
  "Мотивация группы", "Интуиция", "Импровизация", "Хирургия", "Чтение по лицу", "Оценка ресурсов", "Психоанализ", "Фехтование", "Шитьё", "Восстановление одежды",
  "Гидравлика", "Электрика", "Создание фильтров", "Массовая эвакуация", "Быстрое реагирование", "Жестовая речь", "Шифрование", "Математика", "Экономия запасов", "Ремонт сантехники",
  "Оценка структур", "Полевое лечение", "Медицинская импровизация", "Создание убежищ", "Устойчивость к стрессу", "Аналитика", "Механика мотора", "Ведение дневника", "Оповещение", "Работа в команде"
];

export const hobbies = [
  "Чтение", "Пение", "Танцы", "Рисование", "Писательство", "Видеоигры", "Шахматы", "Спорт", "Фотография", "Вязание",
  "Медитация", "Путешествия", "Готовка", "Кулинария", "Фильмы", "Прогулки", "Настолки", "Велоспорт", "Садоводство", "Косплей",
  "Йога", "Рукоделие", "Моделизм", "Сборка Лего", "Диджеинг", "Микширование музыки", "Ремонт", "Кино", "Блоггинг", "Мемы",
  "Фокусы", "Астрономия", "Ролевые игры", "Игра на гитаре", "Флейта", "Игра на барабанах", "Скейтборд", "Катание на роликах", "Походы", "Выживание",
  "Плавание", "Серфинг", "Сноуборд", "Горные лыжи", "Плавание", "Пинг-понг", "Пейнтбол", "Лазертаг", "Караоке", "Криптовалюты",
  "Инвестиции", "Коллекционирование", "Монеты", "Марки", "Настольные игры", "Мафия", "Покер", "Гадание", "Таро", "Моддинг ПК",
  "3D-печать", "Рисование маркером", "Граффити", "DJ-сеты", "Танцы на шесте", "Паркур", "Жонглирование", "Акробатика", "Фехтование", "Боевые искусства",
  "Гармония", "Ведическая кулинария", "Церковное пение", "Изучение языков", "Философия", "Флористика", "Орнитология", "Зоология", "Рыбалка", "Охота",
  "Машиностроение", "Сварка", "Садовод", "Генетика", "Психология", "Соционика", "История", "Археология", "Генеалогия", "Нейросети"
];

export const inventory = [
  "Аптечка", "Нож", "Верёвка", "Топор", "Фонарик", "Спички", "Зажигалка", "Одеяло", "Палатка", "Рация",
  "Консервы", "Баллон с газом", "Фильтр для воды", "Портативная плита", "Карта", "Компас", "Солнечная батарея", "Термос", "Набор инструментов", "Провод",
  "Лом", "Монтировка", "Швейный набор", "Антисептик", "Гигиенические средства", "Скотч", "Полиэтилен", "Дождевик", "Батарейки", "Радиоприёмник",
  "Фляга", "Бинокль", "Перчатки", "Очки", "Блокнот", "Карандаш", "Рюкзак", "Брезент", "Гвозди", "Молоток",
  "Топливо", "Фляга с водой", "Провизия", "Противогаз", "Маска", "Лекарства", "Пластырь", "Обезболивающее", "Антибиотики", "Таблетки йода",
  "Удочка", "Крючки", "Проволока", "Шприцы", "Электрошокер", "Шокер", "Петарда", "Светошумовая граната", "Сухпаёк", "Набор выживания",
  "Пауэрбанк", "Ноутбук", "USB-флешка", "Ножницы", "Пила", "Цепь", "Каска", "Бронежилет", "Шлем", "Щит",
  "Ключи", "Резина", "Медицинские перчатки", "Лупа", "Лампа", "Кипятильник", "Бутылка", "Контейнер", "Батарея", "Электроплита",
  "Солнечный зарядник", "Клеёнка", "Деревянные доски", "Металлические трубы", "Гвоздодёр", "Телефон", "Провода", "Шприц с вакциной", "Записка", "Талисман"
];

export const physiques = [
  "Сильный", "Слабый", "Усталый", "Выносливый", "Плотный", "Худой", "Мускулистый", "Здоровяк", "Тощий", "Нормальный",
  "Атлет", "Медленный", "Быстрый", "Сутулый", "Гибкий", "Неловкий", "Коренастый", "Подвижный", "Ленивый", "Унылый",
  "Поджарый", "Тяжёлый", "Хрупкий", "Подкачанный", "Тренированный", "Неуклюжий", "Зажатый", "Расслабленный", "Измождённый", "Раненый",
  "Полный", "Подбитый", "Накачанный", "Пьяный", "Отекающий", "Дёрганый", "Сбитый с ног", "Упал недавно", "Травмирован", "Потеющий",
  "Потеря крови", "Голодный", "Обезвоженный", "Мёрзнущий", "Уставший", "Парализованный", "Судороги", "На адреналине", "Под таблетками", "Отдыхающий",
  "Измотанный", "Рассечён", "Замёрзший", "Шаткий", "Синяки", "Ссадины", "Трясётся", "Горячка", "Сильная боль", "Сильная усталость",
  "Поясничная боль", "Сломанная рука", "Сломанная нога", "Вывих", "Растяжение", "Боль в груди", "Ожог", "Ожог руки", "Мороз", "Паралич",
  "Заторможен", "Готов к бою", "Падает", "На грани", "Без сознания", "Сломан нос", "Носит броню", "Носит каску", "С трудом дышит", "Шрамы",
  "Кровоподтёки", "Ходит на костылях", "На инвалидной коляске", "Хромает", "Сутулится", "Не может стоять", "Дрожит", "Ломает пальцы", "Быстрое сердцебиение", "Порезан"
];

export const facts = [
  "Герой войны", "Бывший заключённый", "Секретный агент", "Жил в лесу 10 лет", "Пережил авиакатастрофу", "Беженец", "Бывший сектант", "Спас группу детей", "Поджигатель", "Обладатель медали",
  "Умеет жонглировать ножами", "Никогда не врёт", "Слышит голоса", "Спал в гробу", "Вырастил себя сам", "Ребёнок миллиардера", "Изучал ядерную физику", "Влюблён в другого игрока", "Имеет опыт клонирования", "Воспитывался роботами",
  "Работал на ЦРУ", "Был охотником за головами", "Умеет имитировать голос", "Однажды оживлял человека", "Был в Арктике", "Знает 8 языков", "Был космонавтом", "Боялся всего до 25 лет", "Участник апокалипсиса", "Потерял память",
  "Был военным врачом", "Охотился на крокодилов", "Участвовал в уличных боях", "Обманул мафию", "Прошёл горы босиком", "Укротил медведя", "Снимался в кино", "Пел в опере", "Рисует только зубами", "Читал мысли",
  "Разработал шпионские гаджеты", "Мастер маскировки", "Спал 3 года", "Был президентом школы", "Знал будущее", "Жил под землёй", "Копал тоннели", "Работал в морге", "Имел импланты", "Сбежал из лаборатории",
  "Создал культ", "Подменил личность", "Выращивал еду на Марсе", "Подделывал документы", "Пережил судный день", "Писал мемуары", "Имел дело с пришельцами", "Выжил после удара молнии", "Стал героем новостей", "Родился без страха",
  "Жил без воды неделю", "Однажды был мертвецом", "Находил радиоактивные камни", "Прятался в горах", "Поджёг бункер", "Спас 50 человек", "Застрял в подземелье", "Ходил по углям", "Не чувствует боли", "Видел конец света",
  "Проникал в военные базы", "Знает, где склад еды", "Создал собственный язык", "Подменил капитана", "Выдал себя за доктора", "Поднял бунт", "Оказался среди зомби", "Не стареет", "Перенёс смертельную болезнь", "Стал киборгом"
];

